In [1]:
import pandas as pd

In [2]:
student_sheet = "student_detail_test.xls"
sem_sheet = "SEM-I_master sheet_test.xls"
UTD_file = "UTD_test.csv"
current_semester = sem_sheet.split('_')[0] # Extracting Current Semester from file name.

In [4]:

# -----------------------------
# Step 1: Read the Excel file
# -----------------------------
# Load the Excel file without headers so that rows and columns can be accessed by their index.
df_excel = pd.read_excel(sem_sheet, header=None)
df_excel

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,NaN,NaN,NaN,NaN,IN6A-101,IN6A-103,IN6A-105,IN6A-107,IN6A-111,IN6A-121,IN6A-131,NaN,NaN
1,Sr No.,Student Name,Roll Number,Enrolment Number,Engineering Mathematics-I,Applied Physics-I,Engineering Chemistry,Laboratory Work,Communication Skills,Introduction to Programming and Data Structure,Comprehensive Viva Voce,SGPA,Result
2,NaN,NaN,NaN,Credits :-,4,4,4,4,4,4,4,NaN,NaN
3,1,Aamir Khan,22IOT1001,DE220203,C,C,B+,A+,A,B,A,6.857,PASS
4,2,Akshay Kumar,22IOT1002,DE220204,P,C,B,B+,A,P,B+,5.857,PASS
5,3,Ananya Pandey,22IOT1003,DE220205,P,B,P,A,B+,C,B+,5.857,PASS

In [5]:
df_student = pd.read_excel(student_sheet,header=None)
df_student

,0,1,2,3,4,5
0,Course,M.TECH.,NaN,NaN,NaN,NaN
1,Branch,INTERNET OF THINGS (IOT),NaN,NaN,NaN,NaN
2,Batch,2022-2027,NaN,NaN,NaN,NaN
3,Sr No,Name,Roll No.,Enrolment No.,Father’s Name,Mother’s Name
4,1,Aamir Khan,22IOT5001,DE220203,Mr. Bharat,Mrs. Manisha
5,2,Akshay kumar,22IOT5002,DE220204,Mr. Rakesh Kumar,Mrs. Anita
6,3,Ananya Pandey,22IOT5003,DE220205,Mr. Pawan,Mrs. Monika

In [7]:
# Extract Session for particular Batch
session = df_student.iloc[2,1]
session

'2022-2027'

In [8]:
# Extract Parents Names for all Students 
fathers = df_student.iloc[4:,4].reset_index(drop = True)
fathers

0          Mr. Bharat
1    Mr. Rakesh Kumar
2           Mr. Pawan
Name: 4, dtype: object

In [9]:
mothers = df_student.iloc[4:,5].reset_index(drop = True)
mothers

0    Mrs. Manisha
1      Mrs. Anita
2     Mrs. Monika
Name: 5, dtype: object

In [12]:

# Extract roll numbers from column C (index 2) starting from row 4 (index 3)
roll_numbers = df_excel.iloc[3:, 2].reset_index(drop=True)
type(roll_numbers)
roll_numbers

0    22IOT1001
1    22IOT1002
2    22IOT1003
Name: 2, dtype: object

In [13]:
# Extract enrollment numbers from column D (index 3) starting from row 4 (index 3)
enrollment_numbers = df_excel.iloc[3:, 3].reset_index(drop=True)
enrollment_numbers

0    DE220203
1    DE220204
2    DE220205
Name: 3, dtype: object

In [14]:

# Extract Names of Student from column 'B' (index 1) starting from row 4 (index 3)
names = df_excel.iloc[3:, 1].reset_index(drop=True)
names

0       Aamir Khan
1     Akshay Kumar
2    Ananya Pandey
Name: 1, dtype: object

In [16]:
# -----------------------------
# Step 2: Read the CSV file
# -----------------------------
# Load UTD.csv; here it's assumed that the CSV does not have a header.
df_utd = pd.read_csv(UTD_file, header=None)

In [17]:

# -----------------------------
# Step 3: Ensure UTD.csv has enough rows and columns
# -----------------------------
# Calculate required number of rows (roll/enrollment numbers etc. start at row 3)
required_rows = max(len(roll_numbers), len(enrollment_numbers)) + 2  # Account for first 2 rows
if len(df_utd) < required_rows:
    extra_rows = pd.DataFrame([[""] * df_utd.shape[1]] * (required_rows - len(df_utd)))
    df_utd = pd.concat([df_utd, extra_rows], ignore_index=True)

# Step 4: Fill constant data for all students
# -----------------------------
# For each student (starting at row 3 i.e. index 2), fill in columns A-F with constant values.

df_utd.iloc[2:required_rows, 0] = "DEVI AHILYA VISHWAVIDYALAYA INDORE"   # University Name (Column A)
df_utd.iloc[2:required_rows, 1] = "SCHOOL OF INSTRUMENTATION INDORE"     # College Name (Column B)
df_utd.iloc[2:required_rows, 2] = "INTEGRATED M.TECH (IOT)"              # Course Name in Short (Column C)
df_utd.iloc[2:required_rows, 3] = "INTEGRATED MASTER OF TECHNOLOGY"      # Full Course Name (Column D)
df_utd.iloc[2:required_rows, 4] = "INTEGRATED MASTER OF TECHNOLOGY"      # Full Course Name in Detail (Column E)
df_utd.iloc[2:required_rows, 5] = "INTERNET OF THINGS"                   # Stream (Column F)
df_utd.iloc[2:required_rows, 7] = session                                # Session for Batch

In [ ]:
# -----------------------------
# Step 5: Write the data into UTD.csv
# -----------------------------
# Write enrollment numbers into column I (index 8) starting from row 3 (index 2)
for i, enrollment in enumerate(enrollment_numbers):
    df_utd.iat[i + 2, 8] = enrollment

# Write roll numbers into column J (index 9) starting from row 3 (index 2)
for i, roll_number in enumerate(roll_numbers):
    df_utd.iat[i + 2, 9] = roll_number

# Write Names into column  (index 9) starting from row 3 (index 2)
for i, name in enumerate(names):
    df_utd.iat[i + 2, 10] = name

for i, father  in enumerate(fathers):
    df_utd.iat[i + 2, 13] = father

for i, mother in enumerate(mothers):
    df_utd.iat[i + 2, 14] = mother

In [26]:
df_utd.shape

(5, 340)

In [20]:
# -----------------------------
# Step 5: Save the updated CSV file
# -----------------------------
UTD_output_file = "UTD_" + session + '_' + current_semester + '.csv' # Creating a seperate CSV file for different semesters data.
df_utd.to_csv(UTD_output_file, index=False, header=False)
df_utd.head()

,0,1,2,3,4,5,6,7,8,9,...,330,331,332,333,334,335,336,337,338,339
0,ORG_NAME,ORG_NAME_L,ACADEMIC_COURSE_ID,COURSE_NAME,COURSE_NAME_L,STREAM,STREAM_L,SESSION,REGN_NO,RROLL,...,SUB20_PR_MRKS,SUB20_CE_MRKS,SUB20_TOT,SUB20_STATUS,SUB20_GRADE,SUB20_GRADE_POINTS,SUB20_CREDIT,SUB20_CREDIT_POINTS,SUB20_REMARKS,ADMISSION_YEAR
1,University name,College name,COURSE NAME IN SHORT,FULL COURSE NAME,FULL COURSE NAME,STREAM,NaN,SESSION,ENROLLMENT NUMBER,ROLL NUMBER,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,DEVI AHILYA VISHWAVIDYALAYA INDORE,SCHOOL OF INSTRUMENTATION INDORE,INTEGRATED M.TECH (IOT),INTEGRATED MASTER OF TECHNOLOGY,INTEGRATED MASTER OF TECHNOLOGY,INTERNET OF THINGS,NaN,2022-2027,DE220203,22IOT1001,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,DEVI AHILYA VISHWAVIDYALAYA INDORE,SCHOOL OF INSTRUMENTATION INDORE,INTEGRATED M.TECH (IOT),INTEGRATED MASTER OF TECHNOLOGY,INTEGRATED MASTER OF TECHNOLOGY,INTERNET OF THINGS,NaN,2022-2027,DE220204,22IOT1002,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,DEVI AHILYA VISHWAVIDYALAYA INDORE,SCHOOL OF INSTRUMENTATION INDORE,INTEGRATED M.TECH (IOT),INTEGRATED MASTER OF TECHNOLOGY,INTEGRATED MASTER OF TECHNOLOGY,INTERNET OF THINGS,NaN,2022-2027,DE220205,22IOT1003,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [28]:
df_utd.tail()

,0,1,2,3,4,5,6,7,8,9,...,330,331,332,333,334,335,336,337,338,339
0,ORG_NAME,ORG_NAME_L,ACADEMIC_COURSE_ID,COURSE_NAME,COURSE_NAME_L,STREAM,STREAM_L,SESSION,REGN_NO,RROLL,...,SUB20_PR_MRKS,SUB20_CE_MRKS,SUB20_TOT,SUB20_STATUS,SUB20_GRADE,SUB20_GRADE_POINTS,SUB20_CREDIT,SUB20_CREDIT_POINTS,SUB20_REMARKS,ADMISSION_YEAR
1,University name,College name,COURSE NAME IN SHORT,FULL COURSE NAME,FULL COURSE NAME,STREAM,NaN,SESSION,ENROLLMENT NUMBER,ROLL NUMBER,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,DEVI AHILYA VISHWAVIDYALAYA INDORE,SCHOOL OF INSTRUMENTATION INDORE,INTEGRATED M.TECH (IOT),INTEGRATED MASTER OF TECHNOLOGY,INTEGRATED MASTER OF TECHNOLOGY,INTERNET OF THINGS,NaN,2022-2027,DE220203,22IOT1001,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,DEVI AHILYA VISHWAVIDYALAYA INDORE,SCHOOL OF INSTRUMENTATION INDORE,INTEGRATED M.TECH (IOT),INTEGRATED MASTER OF TECHNOLOGY,INTEGRATED MASTER OF TECHNOLOGY,INTERNET OF THINGS,NaN,2022-2027,DE220204,22IOT1002,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,DEVI AHILYA VISHWAVIDYALAYA INDORE,SCHOOL OF INSTRUMENTATION INDORE,INTEGRATED M.TECH (IOT),INTEGRATED MASTER OF TECHNOLOGY,INTEGRATED MASTER OF TECHNOLOGY,INTERNET OF THINGS,NaN,2022-2027,DE220205,22IOT1003,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN